// Завдання
// Реалізувати програму на Javascript, 
// яка знаходитиме всі числа кратні 5 (діляться на 5 без залишку) у заданому діапазоні. 

// Технічні вимоги:
// Отримати за допомогою модального вікна браузера число, яке введе користувач.
// Вивести в консолі всі числа, кратні 5, від 0 до введеного користувачем числа. 
// Якщо таких чисел немає - вивести в консоль фразу "Sorry, no numbers"
// Обов'язково необхідно використовувати синтаксис ES6 (ES2015) для створення змінних.
// Необов'язкове завдання підвищеної складності
// Перевірити, чи введене значення є цілим числом. Якщо ця умова не дотримується, 
// повторювати виведення вікна на екран, доки не буде введено ціле число.
// Отримати два числа, m і n. Вивести в консоль усі прості числа 
// в діапазоні від m до n (менше із введених чисел буде m, більше буде n). 
// Якщо хоча б одне з чисел не відповідає умовам валідації, зазначеним вище, 
// вивести повідомлення про помилку і запитати обидва числа знову.