// Завдання
// Намалювати на сторінці коло за допомогою параметрів, які введе користувач. 

// Технічні вимоги:
// При завантаженні сторінки – показати на ній кнопку з текстом "Намалювати коло". 
// Дана кнопка повинна бути єдиним контентом у тілі HTML документа, 
// решта контенту потрібно створити і додати на сторінку за допомогою Javascript.
// При натисканні на кнопку "Намалювати коло" показувати одне поле введення - діаметр кола. 
// При натисканні на кнопку "Намалювати" створити на сторінці 100 кіл (10*10) випадкового кольору. 
// При кліку на конкретне коло - це коло має зникати, у своїй порожнє місце заповнюватися, 
// тобто інші кола зрушуються вліво.
// У вас може виникнути бажання поставити обробник події на кожне коло для його зникнення. 
// Це неефективно, так не треба робити. На всю сторінку має бути лише один обробник подій, який це робитиме.